# pandas

In [119]:
#  pandas  is the data analysis  library  of python.
#it conatins several functionalities  for   data preprocessing
#based on numpy package

# excel is not suitable for large volume of data
## only  python
pip install pandas

In [120]:
#  Series
it refers to a column in a  data frame

In [121]:
import pandas as pd
s=pd.Series([10,20,30,40])
s

0    10
1    20
2    30
3    40
dtype: int64

In [122]:
type(s)

pandas.core.series.Series

In [123]:
s.dtype

dtype('int64')

In [124]:
s1=pd.Series([10,20,30,"hello"])
s1

0       10
1       20
2       30
3    hello
dtype: object

In [127]:
print(s1.dtype)

object

In [128]:
###  index
import pandas as pd
s=pd.Series([10,20,30,40],index=["a","b","c","d"])
s

a    10
b    20
c    30
d    40
dtype: int64

In [129]:
import pandas as pd
s=pd.Series([10,20,30,40],index=["a","b","c","d"],dtype=float)
s

a    10.0
b    20.0
c    30.0
d    40.0
dtype: float64

In [130]:
#   series  from a dictionary

In [131]:
s2=pd.Series({1:10,2:20})
s2

1    10
2    20
dtype: int64

In [132]:
#  how to access??
#indexing   slicing

In [133]:
import pandas as pd
s=pd.Series([10,20,30,40],index=["a","b","c","d"])
s

a    10
b    20
c    30
d    40
dtype: int64

In [134]:
s['a']

10

In [135]:
s['z']

KeyError: 'z'

In [136]:
s[::-1]

d    40
c    30
b    20
a    10
dtype: int64

In [137]:
max(s)

40

In [138]:
min(s)

10

In [139]:
sum(s)

100

In [141]:
#  add 2 series???
s1=pd.Series([10,20,30,40])
s2=pd.Series([1,2,3])
s1+s2

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

In [142]:
s1*s2

0    10.0
1    40.0
2    90.0
3     NaN
dtype: float64

In [143]:
# data frame
#represent data  in row and column like a table
# collection of series

In [144]:
import pandas as pd
df=pd.DataFrame([10,20,30,40])
df

    0
0  10
1  20
2  30
3  40

In [145]:
type(df)

pandas.core.frame.DataFrame

In [146]:
df1=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]])
df1

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [147]:
##  column names
df1=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]],columns=["a","b","c"])
df1

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [152]:
df1['a']

0    10
1    40
2    70
Name: a, dtype: int64

In [153]:
type(df1['a'])

pandas.core.series.Series

In [154]:
df1[['a']]

    a
0  10
1  40
2  70

In [155]:
type(df1[['a']])

pandas.core.frame.DataFrame

In [159]:
#  create  adat frame  from a dictionary
df3=pd.DataFrame({"roll":[101,102,103,104],\
                  "name":["sachin","saurav","dhoni","rohit"]})
df3

   roll    name
0   101  sachin
1   102  saurav
2   103   dhoni
3   104   rohit

In [160]:
df4=pd.DataFrame({"roll":pd.Series([1,2,3]),"mark":pd.Series([30,40,50,60])})

In [161]:
df4

   roll  mark
0   1.0    30
1   2.0    40
2   3.0    50
3   NaN    60

In [163]:
#  how to access???
df4['roll']

0    1.0
1    2.0
2    3.0
3    NaN
Name: roll, dtype: float64

In [164]:
df1=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]],columns=["a","b","c"])
df1

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [165]:
df1[['a','c']]

    a   c
0  10  30
1  40  60
2  70  90

# CSV   FILE

In [166]:
#comma separated  values  file

In [168]:
#  how to create
# open  notepad
#store  the  values  separated  by comma
# save as  filename.csv
#  load  the file by using  pandas

In [171]:
import pandas as pd
df=pd.read_csv("E:/spoarts.csv")
df

   roll    name  mark
0   101  sachin    70
1   102  saurav    80
2   103   dhoni    90
3   104   rohit    80

In [172]:
type(df)

pandas.core.frame.DataFrame

In [173]:
#  important parameters of  read_csv()
#nrows  ----   read n no of rows

In [175]:
import pandas as pd
df=pd.read_csv("E:/spoarts.csv",nrows=2)
df

   roll    name  mark
0   101  sachin    70
1   102  saurav    80

In [35]:
#usecols --  display  specific columns
import pandas as pd
df=pd.read_csv("E:/spoarts.csv",nrows=2,usecols=[0,2])
df

   roll  mark
0   101    70
1   102    80

In [178]:
#skiprows  ---  used to skip specific  rows

In [182]:
import pandas as pd
df=pd.read_csv("E:/spoarts.csv",skiprows=1)  #skip first row
df

   101  sachin  70
0  102  saurav  80
1  103   dhoni  90
2  104   rohit  80

In [187]:
import pandas as pd
df=pd.read_csv("E:/spoarts.csv",skiprows=[1,3])
df

   roll    name  mark
0   102  saurav    80
1   104   rohit    80

In [188]:
# header ------ used  to mention heading

In [7]:
import pandas as pd
df=pd.read_csv("E:/player.csv")

df

      1       2     3
0  roll    name  addr
1   101  sachin  bbsr
2   102  saurav   ctc
3   103   dhoni  puri

In [4]:
df=pd.read_csv("E:/player.csv",header=1)
df

   roll    name  addr
0   101  sachin  bbsr
1   102  saurav   ctc
2   103   dhoni  puri

In [195]:
df=pd.read_csv("E:/player1.csv")
df

   101  sachin  50
0  102  saurav  60
1  103   rohit  70

In [9]:
df=pd.read_csv("E:/player1.csv",header=None)
df

     0       1   2
0  101  sachin  50
1  102  saurav  60
2  103   rohit  70

In [197]:
# names  
# assign  names to columns

In [36]:
df=pd.read_csv("E:/player1.csv",names=["roll","name","mark"])
df

   roll    name  mark
0   101  sachin    50
1   102  saurav    60
2   103   rohit    70

In [ ]:
######################################

In [ ]:
####################################

#  data science  class  4

In [19]:
#Date ---28-05-2021

In [37]:
# how  to make a column as index????

In [38]:
df=pd.read_csv("E:/player1.csv",names=["roll","name","mark"],\
               index_col=['roll'])
df

        name  mark
roll
101   sachin    50
102   saurav    60
103    rohit    70

In [39]:
df=pd.read_csv("E:/player1.csv",names=["roll","name","mark"],\
               index_col=['name'])
df

        roll  mark
name
sachin   101    50
saurav   102    60
rohit    103    70

In [40]:
##how to access some records  randomly  form a data frame??
#sample()

In [48]:
df=pd.read_csv("E:/iris.csv",names=["sl","sw","pl","pw","class"])

In [45]:
df.sample(5)

      sl   sw   pl   pw            class
83   6.0  2.7  5.1  1.6  Iris-versicolor
50   7.0  3.2  4.7  1.4  Iris-versicolor
122  7.7  2.8  6.7  2.0   Iris-virginica
76   6.8  2.8  4.8  1.4  Iris-versicolor
62   6.0  2.2  4.0  1.0  Iris-versicolor

In [50]:
df.head()#  first  5 rows

    sl   sw   pl   pw        class
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [47]:
df.tail()# last 5 rows

      sl   sw   pl   pw           class
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

#  how  to handle  missing  values  ???

In [ ]:
our  dataset  may conatins  some missing  values
pandas converts  these missing values  to  NaN  ----Not  a Number

In [51]:
import pandas as pd
df=pd.read_csv("E:/mldataset/student1.csv")
df

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0
1   102  saurav   NaN   ctc   NaN
2   103   rohit  17.0   NaN  90.0
3   104     NaN  40.0  puri   NaN
4   105  dinesh   NaN   NaN  75.0

In [ ]:
# pandas  also  converts  the followings   to  NaN automatically

nan
N/A
null
NULL
NaN

In [52]:
df=pd.read_csv("E:/sample.csv")
df

    roll  name  mark
0    NaN   NaN  70.0
1    NaN  ravi   NaN
2  105.0   NaN   NaN

In [53]:
#how to convert  the unwanted  strings  to  NaN
#   to do this read_csv()  has  a parameter   na_values

In [54]:
import pandas  as pd
df=pd.read_csv("E:/mldataset/student2.csv")
df

      roll           name        address           mark
0      101         ranjan           bbsr             70
1      102  not available        missing      not given
2      103      not given  not available             80
3      104          aneel      bengaluru  not available
4  missing          rasmi           bbsr      not given

In [55]:
#   convert  the string  "not available"  to NaN

In [56]:
df=pd.read_csv("E:/mldataset/student2.csv",na_values="not available")
df

      roll       name    address       mark
0      101     ranjan       bbsr         70
1      102        NaN    missing  not given
2      103  not given        NaN         80
3      104      aneel  bengaluru        NaN
4  missing      rasmi       bbsr  not given

In [57]:
#  convert  multiple   strings  to NaN
df=pd.read_csv("E:/mldataset/student2.csv",\
               na_values=["not available","missing","not given"])
df

    roll    name    address  mark
0  101.0  ranjan       bbsr  70.0
1  102.0     NaN        NaN   NaN
2  103.0     NaN        NaN  80.0
3  104.0   aneel  bengaluru   NaN
4    NaN   rasmi       bbsr   NaN

In [58]:
#  convert  specific  strings  from specific columns to NaN

In [59]:
df=pd.read_csv("E:/mldataset/student2.csv",\
               na_values={'address':"missing","mark":"not given"})
df

      roll           name        address           mark
0      101         ranjan           bbsr             70
1      102  not available            NaN            NaN
2      103      not given  not available             80
3      104          aneel      bengaluru  not available
4  missing          rasmi           bbsr            NaN

In [60]:
#  dont  convert  the unwanted  strings to NaN

In [63]:
df=pd.read_csv("E:/sample.csv",keep_default_na=False)
df

   roll  name  mark
0   nan   N/A    70
1  null  ravi  NULL
2   105   NaN   N/A

In [64]:
df=pd.read_csv("E:/sample.csv")
df

    roll  name  mark
0    NaN   NaN  70.0
1    NaN  ravi   NaN
2  105.0   NaN   NaN

In [66]:
# delete  specific  columns from  a dataset???
df=pd.DataFrame([[10,20,30],[40,50,60],[70,80,90]],columns=["A","B","C"])
df

    A   B   C
0  10  20  30
1  40  50  60
2  70  80  90

In [67]:
#remove  column B  from dataframe

In [68]:
df.drop(columns='B')#  df.drop("B",axis=1)

    A   C
0  10  30
1  40  60
2  70  90

In [69]:
#  drop columns A and C
df.drop(columns=['A',"C"])

    B
0  20
1  50
2  80

In [71]:
df.drop("B",axis=1)  #  axis=1  ----column
                     #axis =0  ----row

    A   C
0  10  30
1  40  60
2  70  90

In [72]:
# delete  a specific row
df.drop(index=1)

    A   B   C
0  10  20  30
2  70  80  90

In [74]:
df.drop(1,axis=0)

    A   B   C
0  10  20  30
2  70  80  90

In [ ]:
#  count  NaN  values
isnull() -----check NaN  values
notnull()----  check  not  null values

In [75]:
df=pd.read_csv("E:/mldataset/student1.csv")
df

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0
1   102  saurav   NaN   ctc   NaN
2   103   rohit  17.0   NaN  90.0
3   104     NaN  40.0  puri   NaN
4   105  dinesh   NaN   NaN  75.0

In [76]:
df.isnull()###  return  True/false

    roll   name    age  place   mark
0  False  False  False  False  False
1  False  False   True  False   True
2  False  False  False   True  False
3  False   True  False  False   True
4  False  False   True   True  False

In [77]:
df.isnull().sum()  ###  display  no of nan  values  in each column

roll     0
name     1
age      2
place    2
mark     2
dtype: int64

In [78]:
df.isnull().sum().sum()  #  total  no of missing values in dataset

7

In [79]:
df.notnull().sum()  #  total  not null in each column

roll     5
name     4
age      3
place    3
mark     3
dtype: int64

In [80]:
df.notnull().sum().sum()  # total  not null in entire dataset

18

In [81]:
7/25   ####  percentage  of missing  value

0.28

#  how  to  drop  missing  values  from  dataset

In [83]:
#  use  dropna()  method

In [12]:
df=pd.read_csv("E:/mldataset/student1.csv")
df

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0
1   102  saurav   NaN   ctc   NaN
2   103   rohit  17.0   NaN  90.0
3   104     NaN  40.0  puri   NaN
4   105  dinesh   NaN   NaN  75.0

In [8]:
df.dropna()#  df.dropna(axis=0) -----
#drop all the rows  with  NaN   values

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0

In [13]:
df.dropna(axis=1)
#drop  all the  columns  with NaN  values

   roll
0   101
1   102
2   103
3   104
4   105

In [ ]:
#remove  only those  data  where  all the values are NaN (row wise/columnwise)

important  parameters  of dropna()
axis---0/1
how ---any/all
thresh-None
subset--none

In [89]:
df.dropna(how='all')

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0
1   102  saurav   NaN   ctc   NaN
2   103   rohit  17.0   NaN  90.0
3   104     NaN  40.0  puri   NaN
4   105  dinesh   NaN   NaN  75.0

In [9]:
df.dropna(how='any')  #   deletes those rows  with atleast one nan

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0

In [10]:
df.dropna(how='all') #  deletes  those rows with all  nan  values

   roll    name   age place  mark
0   101  sachin  20.0  bbsr  70.0
1   102  saurav   NaN   ctc   NaN
2   103   rohit  17.0   NaN  90.0
3   104     NaN  40.0  puri   NaN
4   105  dinesh   NaN   NaN  75.0

In [15]:
# add  a new  row  with  all NaN  values
df.loc[5]=[np.nan,np.nan,np.nan,np.nan,np.nan]
df

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [16]:
df.dropna(how='all')

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0

In [17]:
df

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [18]:
#  add a new column to a dataset
df['area']=[np.nan,np.nan,np.nan,np.nan,np.nan,np.nan]

In [19]:
df

    roll    name   age place  mark  area
0  101.0  sachin  20.0  bbsr  70.0   NaN
1  102.0  saurav   NaN   ctc   NaN   NaN
2  103.0   rohit  17.0   NaN  90.0   NaN
3  104.0     NaN  40.0  puri   NaN   NaN
4  105.0  dinesh   NaN   NaN  75.0   NaN
5    NaN     NaN   NaN   NaN   NaN   NaN

In [23]:
#  delete  all those columns  with  only  nan values
df.dropna(how='all',axis=1)

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [21]:
df

    roll    name   age place  mark  area
0  101.0  sachin  20.0  bbsr  70.0   NaN
1  102.0  saurav   NaN   ctc   NaN   NaN
2  103.0   rohit  17.0   NaN  90.0   NaN
3  104.0     NaN  40.0  puri   NaN   NaN
4  105.0  dinesh   NaN   NaN  75.0   NaN
5    NaN     NaN   NaN   NaN   NaN   NaN

In [ ]:
#  how to make  changes  in original data frame???
use  parameter   inplace=True

shift+tab

In [24]:
df.dropna(how='all',axis=1,inplace=True)

In [25]:
df

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [26]:
df

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [ ]:
##  thresh=n

it will  display  those  rows  having  n not not null values

In [27]:
df.dropna(thresh=4)   #rows

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
2  103.0   rohit  17.0   NaN  90.0

In [28]:
df.dropna(thresh=4,axis=1)   ###  columns

    roll    name
0  101.0  sachin
1  102.0  saurav
2  103.0   rohit
3  104.0     NaN
4  105.0  dinesh
5    NaN     NaN

In [29]:
#  subset ---
removes  rows  where  a spefic  column has Nan  value

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
1  102.0  saurav   NaN   ctc   NaN
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN
4  105.0  dinesh   NaN   NaN  75.0
5    NaN     NaN   NaN   NaN   NaN

In [31]:
df.dropna(subset=['age'])

    roll    name   age place  mark
0  101.0  sachin  20.0  bbsr  70.0
2  103.0   rohit  17.0   NaN  90.0
3  104.0     NaN  40.0  puri   NaN

# How  to fill  the  NaN values

# fillna()

used  to fill  the  NaN  values  by some  other values

In [45]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[1,2,3,4,5],\
                 "name":['sachin','saurav',np.nan,np.nan,'rohit'],\
                 'mark':[np.nan,70,np.nan,80,np.nan]})

In [46]:
# add a new column  "country"
df['country']=['india','china',np.nan,'india',np.nan]
df

   roll    name  mark country
0     1  sachin   NaN   india
1     2  saurav  70.0   china
2     3     NaN   NaN     NaN
3     4     NaN  80.0   india
4     5   rohit   NaN     NaN

In [37]:
df.fillna('0')  ##   replace  all nan value by 0

   roll    name mark country
0     1  sachin    0   india
1     2  saurav   70   china
2     3       0    0       0
3     4       0   80   india
4     5   rohit    0       0

In [38]:
##   fill  the nan values  of specific  columns by specific value

In [39]:
df.fillna({'name':'dhoni','mark':50,'country':"INDIA"})

   roll    name  mark country
0     1  sachin  50.0   india
1     2  saurav  70.0   china
2     3   dhoni  50.0   INDIA
3     4   dhoni  80.0   india
4     5   rohit  50.0   INDIA

In [ ]:
#  method= ffill/pad  ----fill the nan value  by its  previous value
           bfill/backfill ---fill the nan value by next value

In [42]:
df

   roll    name  mark country
0     1  sachin   NaN   india
1     2  saurav  70.0   china
2     3     NaN   NaN     NaN
3     4     NaN  80.0   india
4     5   rohit   NaN     NaN

In [41]:
df.fillna(method='ffill')

   roll    name  mark country
0     1  sachin   NaN   india
1     2  saurav  70.0   china
2     3  saurav  70.0   china
3     4  saurav  80.0   india
4     5   rohit  80.0   india

In [43]:
df.fillna(method='bfill')

   roll    name  mark country
0     1  sachin  70.0   india
1     2  saurav  70.0   china
2     3   rohit  80.0   india
3     4   rohit  80.0   india
4     5   rohit   NaN     NaN

In [ ]:
#how to  update  the original  dataframe??
#inplace=True

In [44]:
df.fillna(0,inplace=True)
df

   roll    name  mark country
0     1  sachin   0.0   india
1     2  saurav  70.0   china
2     3       0   0.0       0
3     4       0  80.0   india
4     5   rohit   0.0       0

In [47]:
#  consider  original datframe
df

   roll    name  mark country
0     1  sachin   NaN   india
1     2  saurav  70.0   china
2     3     NaN   NaN     NaN
3     4     NaN  80.0   india
4     5   rohit   NaN     NaN

In [50]:
df.fillna("0000",limit=2)  ####   only  2 nan values of each column 
                            # will be filled by"0000"

   roll    name  mark country
0     1  sachin  0000   india
1     2  saurav    70   china
2     3    0000  0000    0000
3     4    0000    80   india
4     5   rohit   NaN    0000

#  replace()  method

In [51]:
#it replaces  specific values   by some other values

In [52]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'roll':[1,2,3,4,5],\
                 "name":['sachin','saurav','dhoni','rahul','rohit'],\
                 'mark':[60,70,75,80,55]})
df

   roll    name  mark
0     1  sachin    60
1     2  saurav    70
2     3   dhoni    75
3     4   rahul    80
4     5   rohit    55

In [53]:
df.replace('sachin','dhoni')

   roll    name  mark
0     1   dhoni    60
1     2  saurav    70
2     3   dhoni    75
3     4   rahul    80
4     5   rohit    55

In [54]:
df.replace(to_replace='sachin',value='dhoni')

   roll    name  mark
0     1   dhoni    60
1     2  saurav    70
2     3   dhoni    75
3     4   rahul    80
4     5   rohit    55

In [55]:
#  inplace=True     actual  dataframe will be updated

In [56]:
#regex---  regular  expression
#pattern matching

In [57]:
df

   roll    name  mark
0     1  sachin    60
1     2  saurav    70
2     3   dhoni    75
3     4   rahul    80
4     5   rohit    55

In [75]:
df.replace('[A-Z a-z]',1,regex=True)

   roll  name  mark
0     1     1    60
1     2     1    70
2     3     1    75
3     4     1    80
4     5     1    55

In [76]:
#   replace  specific  value of a specific  column
df.replace({'name':'sachin'},"RAHUL")

   roll    name  mark
0     1   RAHUL    60
1     2  saurav    70
2     3   dhoni    75
3     4   rahul    80
4     5   rohit    55